W9D2/firstroutes/app/controllers/users_controller.rb

  def create

    new_user = User.new(user_params)
    new_user.save!
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Martin"], ["email", "martin@montenegro.com"], ["created_at", "2019-03-04 22:39:54.378025"], ["updated_at", "2019-03-04 22:39:54.378025"]]

  def update
    user = User.find(params[:id])

    if user
      # User.update(user.id, user_params)
      user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "Charlemegne"], ["updated_at", "2019-03-05 00:20:28.698079"], ["id", 10]]

  def destroy

    user = User.find(params[:id])

    if user
      user.destroy
      render json: User.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 5]]
SELECT "users".* FROM "users"